WcfHarness/WcfHarness/RequestXmls/DeleteUserGroup_HardDelete.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <DeleteUserGroup xmlns="http://www.tavisca.com/Vexiere/IUserGroup/2013/01">
      <deleteUserRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:IsHardDelete>true</a:IsHardDelete>
        <a:UserGroupIdentifier i:type="a:IdBasedUserGroupIdentifier">
          <a:Id>2</a:Id>
        </a:UserGroupIdentifier>
      </deleteUserRequest>
    </DeleteUserGroup>
  </s:Body>
</s:Envelope>